leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.CSRC */
#define IFX_VADC_G_ARBCFG_CSRC_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.CSRC */
#define IFX_VADC_G_ARBCFG_CSRC_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.CSRC */
#define IFX_VADC_G_ARBCFG_CSRC_OFF (18u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_VADC_G_ARBCFG_SAMPLE_OFF (31u)

/** \brief  Length for Ifx_VADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_VADC_G_ARBCFG_SYNRUN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_VADC_G_ARBCFG_SYNRUN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_VADC_G_ARBCFG_SYNRUN_OFF (25u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN0 */
#define IFX_VADC_G_ARBPR_ASEN0_OFF (24u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN1 */
#define IFX_VADC_G_ARBPR_ASEN1_OFF (25u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN2 */
#define IFX_VADC_G_ARBPR_ASEN2_OFF (26u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.ASEN3 */
#define IFX_VADC_G_ARBPR_ASEN3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.ASEN3 */
#define IFX_VADC_G_ARBPR_ASEN3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.ASEN3 */
#define IFX_VADC_G_ARBPR_ASEN3_OFF (27u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM0 */
#define IFX_VADC_G_ARBPR_CSM0_OFF (3u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM1 */
#define IFX_VADC_G_ARBPR_CSM1_OFF (7u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM2 */
#define IFX_VADC_G_ARBPR_CSM2_OFF (11u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.CSM3 */
#define IFX_VADC_G_ARBPR_CSM3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.CSM3 */
#define IFX_VADC_G_ARBPR_CSM3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.CSM3 */
#define IFX_VADC_G_ARBPR_CSM3_OFF (15u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO0 */
#define IFX_VADC_G_ARBPR_PRIO0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO1 */
#define IFX_VADC_G_ARBPR_PRIO1_OFF (4u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO2 */
#define IFX_VADC_G_ARBPR_PRIO2_OFF (8u)

/** \brief  Length for Ifx_VADC_G_ARBPR_Bits.PRIO3 */
#define IFX_VADC_G_ARBPR_PRIO3_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ARBPR_Bits.PRIO3 */
#define IFX_VADC_G_ARBPR_PRIO3_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ARBPR_Bits.PRIO3 */
#define IFX_VADC_G_ARBPR_PRIO3_OFF (12u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTLVL */
#define IFX_VADC_G_ASCTRL_GTLVL_OFF (20u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTSEL */
#define IFX_VADC_G_ASCTRL_GTSEL_OFF (16u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.GTWC */
#define IFX_VADC_G_ASCTRL_GTWC_OFF (23u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.SRCRESREG */
#define IFX_VADC_G_ASCTRL_SRCRESREG_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.SRCRESREG */
#define IFX_VADC_G_ASCTRL_SRCRESREG_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.SRCRESREG */
#define IFX_VADC_G_ASCTRL_SRCRESREG_OFF (0u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.TMEN */
#define IFX_VADC_G_ASCTRL_TMEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.TMEN */
#define IFX_VADC_G_ASCTRL_TMEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.TMEN */
#define IFX_VADC_G_ASCTRL_TMEN_OFF (28u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.TMWC */
#define IFX_VADC_G_ASCTRL_TMWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.TMWC */
#define IFX_VADC_G_ASCTRL_TMWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.TMWC */
#define IFX_VADC_G_ASCTRL_TMWC_OFF (31u)

