leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTLVL */
#define IFX_VADC_G_ASCTRL_XTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTLVL */
#define IFX_VADC_G_ASCTRL_XTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTLVL */
#define IFX_VADC_G_ASCTRL_XTLVL_OFF (12u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTMODE */
#define IFX_VADC_G_ASCTRL_XTMODE_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTMODE */
#define IFX_VADC_G_ASCTRL_XTMODE_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTMODE */
#define IFX_VADC_G_ASCTRL_XTMODE_OFF (13u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTSEL */
#define IFX_VADC_G_ASCTRL_XTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTSEL */
#define IFX_VADC_G_ASCTRL_XTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTSEL */
#define IFX_VADC_G_ASCTRL_XTSEL_OFF (8u)

/** \brief  Length for Ifx_VADC_G_ASCTRL_Bits.XTWC */
#define IFX_VADC_G_ASCTRL_XTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASCTRL_Bits.XTWC */
#define IFX_VADC_G_ASCTRL_XTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASCTRL_Bits.XTWC */
#define IFX_VADC_G_ASCTRL_XTWC_OFF (15u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.CLRPND */
#define IFX_VADC_G_ASMR_CLRPND_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.CLRPND */
#define IFX_VADC_G_ASMR_CLRPND_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.CLRPND */
#define IFX_VADC_G_ASMR_CLRPND_OFF (8u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.ENGT */
#define IFX_VADC_G_ASMR_ENGT_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.ENGT */
#define IFX_VADC_G_ASMR_ENGT_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.ENGT */
#define IFX_VADC_G_ASMR_ENGT_OFF (0u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.ENSI */
#define IFX_VADC_G_ASMR_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.ENSI */
#define IFX_VADC_G_ASMR_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.ENSI */
#define IFX_VADC_G_ASMR_ENSI_OFF (3u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.ENTR */
#define IFX_VADC_G_ASMR_ENTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.ENTR */
#define IFX_VADC_G_ASMR_ENTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.ENTR */
#define IFX_VADC_G_ASMR_ENTR_OFF (2u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.LDEV */
#define IFX_VADC_G_ASMR_LDEV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.LDEV */
#define IFX_VADC_G_ASMR_LDEV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.LDEV */
#define IFX_VADC_G_ASMR_LDEV_OFF (9u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.LDM */
#define IFX_VADC_G_ASMR_LDM_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.LDM */
#define IFX_VADC_G_ASMR_LDM_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.LDM */
#define IFX_VADC_G_ASMR_LDM_OFF (5u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.REQGT */
#define IFX_VADC_G_ASMR_REQGT_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.REQGT */
#define IFX_VADC_G_ASMR_REQGT_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.REQGT */
#define IFX_VADC_G_ASMR_REQGT_OFF (7u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.RPTDIS */
#define IFX_VADC_G_ASMR_RPTDIS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.RPTDIS */
#define IFX_VADC_G_ASMR_RPTDIS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.RPTDIS */
#define IFX_VADC_G_ASMR_RPTDIS_OFF (16u)

/** \brief  Length for Ifx_VADC_G_ASMR_Bits.SCAN */
#define IFX_VADC_G_ASMR_SCAN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_ASMR_Bits.SCAN */
#define IFX_VADC_G_ASMR_SCAN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_ASMR_Bits.SCAN */
#define IFX_VADC_G_ASMR_SCAN_OFF (4u)

/** \brief  Length for Ifx_VADC_G_ASPND_Bits.CHPND */
#define IFX_VADC_G_ASPND_CHPND_LEN (32u)

/** \brief  Mask for Ifx_VADC_G_ASPND_Bits.CHPND */
#define IFX_VADC_G_ASPND_CHPND_MSK (0xffffffffu)

/** \brief  Offset for Ifx_VADC_G_ASPND_Bits.CHPND */
#define IFX_VADC_G_ASPND_CHPND_OFF (0u)

/** \brief  Length for Ifx_VADC_G_ASSEL_Bits.CHSEL */
#define IFX_VADC_G_ASSEL_CHSEL_LEN (32u)

/** \brief  Mask for Ifx_VADC_G_ASSEL_Bits.CHSEL */
#define IFX_VADC_G_ASSEL_CHSEL_MSK (0xffffffffu)

/** \brief  Offset for Ifx_VADC_G_ASSEL_Bits.CHSEL */
#define IFX_VADC_G_ASSEL_CHSEL_OFF (0u)

/** \brief  Length for Ifx_VADC_G_BFL_Bits.BFA0 */
#define IFX_VADC_G_BFL_BFA0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFL_Bits.BFA0 */
#define IFX_VADC_G_BFL_BFA0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFL_Bits.BFA0 */
#define IFX_VADC_G_BFL_BFA0_OFF (8u)

/** \brief  Length for Ifx_VADC_G_BFL_Bits.BFA1 */
#define IFX_VADC_G_BFL_BFA1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFL_Bits.BFA1 */
#define IFX_VADC_G_BFL_BFA1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFL_Bits.BFA1 */
#define IFX_VADC_G_BFL_BFA1_OFF (9u)

/** \brief  Length for Ifx_VADC_G_BFL_Bits.BFA2 */
#define IFX_VADC_G_BFL_BFA2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFL_Bits.BFA2 */
#define IFX_VADC_G_BFL_BFA2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFL_Bits.BFA2 */
#define IFX_VADC_G_BFL_BFA2_OFF (10u)

/** \brief  Length for Ifx_VADC_G_BFL_Bits.BFA3 */
#define IFX_VADC_G_BFL_BFA3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFL_Bits.BFA3 */
#define IFX_VADC_G_BFL_BFA3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFL_Bits.BFA3 */
#define IFX_VADC_G_BFL_BFA3_OFF (11u)

/** \brief  Length for Ifx_VADC_G_BFL_Bits.BFI0 */
#define IFX_VADC_G_BFL_BFI0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFL_Bits.BFI0 */
#define IFX_VADC_G_BFL_BFI0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFL_Bits.BFI0 */
#define IFX_VADC_G_BFL_BFI0_OFF (16u)

/** \brief  Length for Ifx_VADC_G_BFL_Bits.BFI1 */
#define IFX_VADC_G_BFL_BFI1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFL_Bits.BFI1 */
#define IFX_VADC_G_BFL_BFI1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFL_Bits.BFI1 */
#define IFX_VADC_G_BFL_BFI1_OFF (17u)

/** \brief  Length for Ifx_VADC_G_BFL_Bits.BFI2 */
#define IFX_VADC_G_BFL_BFI2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_BFL_Bits.BFI2 */
#define IFX_VADC_G_BFL_BFI2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_BFL_Bits.BFI2 */
#define IFX_VADC_G_BFL_BFI2_OFF (18u)

