leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_bf.h
/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_G_CHCTR_CHEVMODE_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.CHEVMODE */
#define IFX_VADC_G_CHCTR_CHEVMODE_OFF (8u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.ICLSEL */
#define IFX_VADC_G_CHCTR_ICLSEL_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.ICLSEL */
#define IFX_VADC_G_CHCTR_ICLSEL_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.ICLSEL */
#define IFX_VADC_G_CHCTR_ICLSEL_OFF (0u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.REFSEL */
#define IFX_VADC_G_CHCTR_REFSEL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.REFSEL */
#define IFX_VADC_G_CHCTR_REFSEL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.REFSEL */
#define IFX_VADC_G_CHCTR_REFSEL_OFF (11u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.RESPOS */
#define IFX_VADC_G_CHCTR_RESPOS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.RESPOS */
#define IFX_VADC_G_CHCTR_RESPOS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.RESPOS */
#define IFX_VADC_G_CHCTR_RESPOS_OFF (21u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.RESREG */
#define IFX_VADC_G_CHCTR_RESREG_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.RESREG */
#define IFX_VADC_G_CHCTR_RESREG_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.RESREG */
#define IFX_VADC_G_CHCTR_RESREG_OFF (16u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.RESTBS */
#define IFX_VADC_G_CHCTR_RESTBS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.RESTBS */
#define IFX_VADC_G_CHCTR_RESTBS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.RESTBS */
#define IFX_VADC_G_CHCTR_RESTBS_OFF (20u)

/** \brief  Length for Ifx_VADC_G_CHCTR_Bits.SYNC */
#define IFX_VADC_G_CHCTR_SYNC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_CHCTR_Bits.SYNC */
#define IFX_VADC_G_CHCTR_SYNC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_CHCTR_Bits.SYNC */
#define IFX_VADC_G_CHCTR_SYNC_OFF (10u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_VADC_G_EMUXCTR_EMUXACT_LEN (3u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_VADC_G_EMUXCTR_EMUXACT_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXACT */
#define IFX_VADC_G_EMUXCTR_EMUXACT_OFF (8u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXCH */
#define IFX_VADC_G_EMUXCTR_EMUXCH_LEN (10u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXCH */
#define IFX_VADC_G_EMUXCTR_EMUXCH_MSK (0x3ffu)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXCH */
#define IFX_VADC_G_EMUXCTR_EMUXCH_OFF (16u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_OFF (26u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_LEN (3u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_OFF (0u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_OFF (28u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_OFF (30u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_OFF (29u)

/** \brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_OFF (31u)

/** \brief  Length for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_OFF (6u)

/** \brief  Length for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_OFF (7u)

/** \brief  Length for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_OFF (5u)

/** \brief  Length for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_OFF (8u)

/** \brief  Length for Ifx_VADC_G_Q0R3_Bits.CDEN */
#define IFX_VADC_G_Q0R3_CDEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R3_Bits.CDEN */
#define IFX_VADC_G_Q0R3_CDEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R3_Bits.CDEN */
#define IFX_VADC_G_Q0R3_CDEN_OFF (12u)

/** \brief  Length for Ifx_VADC_G_Q0R3_Bits.CDSEL */
#define IFX_VADC_G_Q0R3_CDSEL_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_Q0R3_Bits.CDSEL */
#define IFX_VADC_G_Q0R3_CDSEL_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_Q0R3_Bits.CDSEL */
#define IFX_VADC_G_Q0R3_CDSEL_OFF (13u)

/** \brief  Length for Ifx_VADC_G_Q0R3_Bits.ENSI */
#define IFX_VADC_G_Q0R3_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R3_Bits.ENSI */
#define IFX_VADC_G_Q0R3_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R3_Bits.ENSI */
#define IFX_VADC_G_Q0R3_ENSI_OFF (6u)

/** \brief  Length for Ifx_VADC_G_Q0R3_Bits.EXTR */
#define IFX_VADC_G_Q0R3_EXTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R3_Bits.EXTR */
#define IFX_VADC_G_Q0R3_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R3_Bits.EXTR */
#define IFX_VADC_G_Q0R3_EXTR_OFF (7u)

/** \brief  Length for Ifx_VADC_G_Q0R3_Bits.MDPD */
#define IFX_VADC_G_Q0R3_MDPD_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R3_Bits.MDPD */
#define IFX_VADC_G_Q0R3_MDPD_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R3_Bits.MDPD */
#define IFX_VADC_G_Q0R3_MDPD_OFF (10u)

