leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_G_Q0R3_Bits.MDPU */
#define IFX_VADC_G_Q0R3_MDPU_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R3_Bits.MDPU */
#define IFX_VADC_G_Q0R3_MDPU_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R3_Bits.MDPU */
#define IFX_VADC_G_Q0R3_MDPU_OFF (11u)

/** \brief  Length for Ifx_VADC_G_Q0R3_Bits.PDD */
#define IFX_VADC_G_Q0R3_PDD_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R3_Bits.PDD */
#define IFX_VADC_G_Q0R3_PDD_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R3_Bits.PDD */
#define IFX_VADC_G_Q0R3_PDD_OFF (9u)

/** \brief  Length for Ifx_VADC_G_Q0R3_Bits.REQCHNR */
#define IFX_VADC_G_Q0R3_REQCHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_Q0R3_Bits.REQCHNR */
#define IFX_VADC_G_Q0R3_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_Q0R3_Bits.REQCHNR */
#define IFX_VADC_G_Q0R3_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_VADC_G_Q0R3_Bits.RF */
#define IFX_VADC_G_Q0R3_RF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R3_Bits.RF */
#define IFX_VADC_G_Q0R3_RF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R3_Bits.RF */
#define IFX_VADC_G_Q0R3_RF_OFF (5u)

/** \brief  Length for Ifx_VADC_G_Q0R3_Bits.V */
#define IFX_VADC_G_Q0R3_V_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_Q0R3_Bits.V */
#define IFX_VADC_G_Q0R3_V_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_Q0R3_Bits.V */
#define IFX_VADC_G_Q0R3_V_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR0_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR0_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR0_ENSI_OFF (6u)

/** \brief  Length for Ifx_VADC_G_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR0_EXTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR0_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR0_EXTR_OFF (7u)

/** \brief  Length for Ifx_VADC_G_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR0_REQCHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR0_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR0_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR0_RF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR0_RF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR0_RF_OFF (5u)

/** \brief  Length for Ifx_VADC_G_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR0_V_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR0_V_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR0_V_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QBUR3_Bits.CDEN */
#define IFX_VADC_G_QBUR3_CDEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR3_Bits.CDEN */
#define IFX_VADC_G_QBUR3_CDEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR3_Bits.CDEN */
#define IFX_VADC_G_QBUR3_CDEN_OFF (12u)

/** \brief  Length for Ifx_VADC_G_QBUR3_Bits.CDSEL */
#define IFX_VADC_G_QBUR3_CDSEL_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_QBUR3_Bits.CDSEL */
#define IFX_VADC_G_QBUR3_CDSEL_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_QBUR3_Bits.CDSEL */
#define IFX_VADC_G_QBUR3_CDSEL_OFF (13u)

/** \brief  Length for Ifx_VADC_G_QBUR3_Bits.ENSI */
#define IFX_VADC_G_QBUR3_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR3_Bits.ENSI */
#define IFX_VADC_G_QBUR3_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR3_Bits.ENSI */
#define IFX_VADC_G_QBUR3_ENSI_OFF (6u)

/** \brief  Length for Ifx_VADC_G_QBUR3_Bits.EXTR */
#define IFX_VADC_G_QBUR3_EXTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR3_Bits.EXTR */
#define IFX_VADC_G_QBUR3_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR3_Bits.EXTR */
#define IFX_VADC_G_QBUR3_EXTR_OFF (7u)

/** \brief  Length for Ifx_VADC_G_QBUR3_Bits.MDPD */
#define IFX_VADC_G_QBUR3_MDPD_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR3_Bits.MDPD */
#define IFX_VADC_G_QBUR3_MDPD_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR3_Bits.MDPD */
#define IFX_VADC_G_QBUR3_MDPD_OFF (10u)

/** \brief  Length for Ifx_VADC_G_QBUR3_Bits.MDPU */
#define IFX_VADC_G_QBUR3_MDPU_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR3_Bits.MDPU */
#define IFX_VADC_G_QBUR3_MDPU_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR3_Bits.MDPU */
#define IFX_VADC_G_QBUR3_MDPU_OFF (11u)

/** \brief  Length for Ifx_VADC_G_QBUR3_Bits.PDD */
#define IFX_VADC_G_QBUR3_PDD_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR3_Bits.PDD */
#define IFX_VADC_G_QBUR3_PDD_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR3_Bits.PDD */
#define IFX_VADC_G_QBUR3_PDD_OFF (9u)

/** \brief  Length for Ifx_VADC_G_QBUR3_Bits.REQCHNR */
#define IFX_VADC_G_QBUR3_REQCHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_QBUR3_Bits.REQCHNR */
#define IFX_VADC_G_QBUR3_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_QBUR3_Bits.REQCHNR */
#define IFX_VADC_G_QBUR3_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QBUR3_Bits.RF */
#define IFX_VADC_G_QBUR3_RF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR3_Bits.RF */
#define IFX_VADC_G_QBUR3_RF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR3_Bits.RF */
#define IFX_VADC_G_QBUR3_RF_OFF (5u)

/** \brief  Length for Ifx_VADC_G_QBUR3_Bits.V */
#define IFX_VADC_G_QBUR3_V_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QBUR3_Bits.V */
#define IFX_VADC_G_QBUR3_V_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QBUR3_Bits.V */
#define IFX_VADC_G_QBUR3_V_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_OFF (20u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_OFF (16u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_OFF (23u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_LEN (1u)

