leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_bf.h
/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_OFF (28u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_OFF (31u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_OFF (12u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_OFF (13u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_OFF (15u)

/** \brief  Length for Ifx_VADC_G_QCTRL3_Bits.GTLVL */
#define IFX_VADC_G_QCTRL3_GTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL3_Bits.GTLVL */
#define IFX_VADC_G_QCTRL3_GTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL3_Bits.GTLVL */
#define IFX_VADC_G_QCTRL3_GTLVL_OFF (20u)

/** \brief  Length for Ifx_VADC_G_QCTRL3_Bits.GTSEL */
#define IFX_VADC_G_QCTRL3_GTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QCTRL3_Bits.GTSEL */
#define IFX_VADC_G_QCTRL3_GTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QCTRL3_Bits.GTSEL */
#define IFX_VADC_G_QCTRL3_GTSEL_OFF (16u)

/** \brief  Length for Ifx_VADC_G_QCTRL3_Bits.GTWC */
#define IFX_VADC_G_QCTRL3_GTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL3_Bits.GTWC */
#define IFX_VADC_G_QCTRL3_GTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL3_Bits.GTWC */
#define IFX_VADC_G_QCTRL3_GTWC_OFF (23u)

/** \brief  Length for Ifx_VADC_G_QCTRL3_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL3_SRCRESREG_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QCTRL3_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL3_SRCRESREG_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QCTRL3_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL3_SRCRESREG_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QCTRL3_Bits.TMEN */
#define IFX_VADC_G_QCTRL3_TMEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL3_Bits.TMEN */
#define IFX_VADC_G_QCTRL3_TMEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL3_Bits.TMEN */
#define IFX_VADC_G_QCTRL3_TMEN_OFF (28u)

/** \brief  Length for Ifx_VADC_G_QCTRL3_Bits.TMWC */
#define IFX_VADC_G_QCTRL3_TMWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL3_Bits.TMWC */
#define IFX_VADC_G_QCTRL3_TMWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL3_Bits.TMWC */
#define IFX_VADC_G_QCTRL3_TMWC_OFF (31u)

/** \brief  Length for Ifx_VADC_G_QCTRL3_Bits.XTLVL */
#define IFX_VADC_G_QCTRL3_XTLVL_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL3_Bits.XTLVL */
#define IFX_VADC_G_QCTRL3_XTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL3_Bits.XTLVL */
#define IFX_VADC_G_QCTRL3_XTLVL_OFF (12u)

/** \brief  Length for Ifx_VADC_G_QCTRL3_Bits.XTMODE */
#define IFX_VADC_G_QCTRL3_XTMODE_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_QCTRL3_Bits.XTMODE */
#define IFX_VADC_G_QCTRL3_XTMODE_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_QCTRL3_Bits.XTMODE */
#define IFX_VADC_G_QCTRL3_XTMODE_OFF (13u)

/** \brief  Length for Ifx_VADC_G_QCTRL3_Bits.XTSEL */
#define IFX_VADC_G_QCTRL3_XTSEL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QCTRL3_Bits.XTSEL */
#define IFX_VADC_G_QCTRL3_XTSEL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QCTRL3_Bits.XTSEL */
#define IFX_VADC_G_QCTRL3_XTSEL_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QCTRL3_Bits.XTWC */
#define IFX_VADC_G_QCTRL3_XTWC_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QCTRL3_Bits.XTWC */
#define IFX_VADC_G_QCTRL3_XTWC_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QCTRL3_Bits.XTWC */
#define IFX_VADC_G_QCTRL3_XTWC_OFF (15u)

/** \brief  Length for Ifx_VADC_G_QINR0_Bits.ENSI */
#define IFX_VADC_G_QINR0_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR0_Bits.ENSI */
#define IFX_VADC_G_QINR0_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR0_Bits.ENSI */
#define IFX_VADC_G_QINR0_ENSI_OFF (6u)

/** \brief  Length for Ifx_VADC_G_QINR0_Bits.EXTR */
#define IFX_VADC_G_QINR0_EXTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR0_Bits.EXTR */
#define IFX_VADC_G_QINR0_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR0_Bits.EXTR */
#define IFX_VADC_G_QINR0_EXTR_OFF (7u)

/** \brief  Length for Ifx_VADC_G_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QINR0_REQCHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QINR0_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QINR0_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QINR0_Bits.RF */
#define IFX_VADC_G_QINR0_RF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR0_Bits.RF */
#define IFX_VADC_G_QINR0_RF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR0_Bits.RF */
#define IFX_VADC_G_QINR0_RF_OFF (5u)

/** \brief  Length for Ifx_VADC_G_QINR3_Bits.CDEN */
#define IFX_VADC_G_QINR3_CDEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR3_Bits.CDEN */
#define IFX_VADC_G_QINR3_CDEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR3_Bits.CDEN */
#define IFX_VADC_G_QINR3_CDEN_OFF (12u)

/** \brief  Length for Ifx_VADC_G_QINR3_Bits.CDSEL */
#define IFX_VADC_G_QINR3_CDSEL_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_QINR3_Bits.CDSEL */
#define IFX_VADC_G_QINR3_CDSEL_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_QINR3_Bits.CDSEL */
#define IFX_VADC_G_QINR3_CDSEL_OFF (13u)

/** \brief  Length for Ifx_VADC_G_QINR3_Bits.ENSI */
#define IFX_VADC_G_QINR3_ENSI_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR3_Bits.ENSI */
#define IFX_VADC_G_QINR3_ENSI_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR3_Bits.ENSI */
#define IFX_VADC_G_QINR3_ENSI_OFF (6u)

/** \brief  Length for Ifx_VADC_G_QINR3_Bits.EXTR */
#define IFX_VADC_G_QINR3_EXTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR3_Bits.EXTR */
#define IFX_VADC_G_QINR3_EXTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR3_Bits.EXTR */
#define IFX_VADC_G_QINR3_EXTR_OFF (7u)

/** \brief  Length for Ifx_VADC_G_QINR3_Bits.MDPD */
#define IFX_VADC_G_QINR3_MDPD_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR3_Bits.MDPD */
#define IFX_VADC_G_QINR3_MDPD_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR3_Bits.MDPD */
#define IFX_VADC_G_QINR3_MDPD_OFF (10u)

/** \brief  Length for Ifx_VADC_G_QINR3_Bits.MDPU */
#define IFX_VADC_G_QINR3_MDPU_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR3_Bits.MDPU */
#define IFX_VADC_G_QINR3_MDPU_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR3_Bits.MDPU */
#define IFX_VADC_G_QINR3_MDPU_OFF (11u)

