leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_G_QINR3_Bits.PDD */
#define IFX_VADC_G_QINR3_PDD_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR3_Bits.PDD */
#define IFX_VADC_G_QINR3_PDD_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR3_Bits.PDD */
#define IFX_VADC_G_QINR3_PDD_OFF (9u)

/** \brief  Length for Ifx_VADC_G_QINR3_Bits.REQCHNR */
#define IFX_VADC_G_QINR3_REQCHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_QINR3_Bits.REQCHNR */
#define IFX_VADC_G_QINR3_REQCHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_QINR3_Bits.REQCHNR */
#define IFX_VADC_G_QINR3_REQCHNR_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QINR3_Bits.RF */
#define IFX_VADC_G_QINR3_RF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QINR3_Bits.RF */
#define IFX_VADC_G_QINR3_RF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QINR3_Bits.RF */
#define IFX_VADC_G_QINR3_RF_OFF (5u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_OFF (11u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_OFF (2u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_OFF (10u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_OFF (16u)

/** \brief  Length for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_OFF (9u)

/** \brief  Length for Ifx_VADC_G_QMR3_Bits.CEV */
#define IFX_VADC_G_QMR3_CEV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR3_Bits.CEV */
#define IFX_VADC_G_QMR3_CEV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR3_Bits.CEV */
#define IFX_VADC_G_QMR3_CEV_OFF (11u)

/** \brief  Length for Ifx_VADC_G_QMR3_Bits.CLRV */
#define IFX_VADC_G_QMR3_CLRV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR3_Bits.CLRV */
#define IFX_VADC_G_QMR3_CLRV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR3_Bits.CLRV */
#define IFX_VADC_G_QMR3_CLRV_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QMR3_Bits.ENGT */
#define IFX_VADC_G_QMR3_ENGT_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_QMR3_Bits.ENGT */
#define IFX_VADC_G_QMR3_ENGT_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_QMR3_Bits.ENGT */
#define IFX_VADC_G_QMR3_ENGT_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QMR3_Bits.ENTR */
#define IFX_VADC_G_QMR3_ENTR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR3_Bits.ENTR */
#define IFX_VADC_G_QMR3_ENTR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR3_Bits.ENTR */
#define IFX_VADC_G_QMR3_ENTR_OFF (2u)

/** \brief  Length for Ifx_VADC_G_QMR3_Bits.FLUSH */
#define IFX_VADC_G_QMR3_FLUSH_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR3_Bits.FLUSH */
#define IFX_VADC_G_QMR3_FLUSH_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR3_Bits.FLUSH */
#define IFX_VADC_G_QMR3_FLUSH_OFF (10u)

/** \brief  Length for Ifx_VADC_G_QMR3_Bits.RPTDIS */
#define IFX_VADC_G_QMR3_RPTDIS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR3_Bits.RPTDIS */
#define IFX_VADC_G_QMR3_RPTDIS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR3_Bits.RPTDIS */
#define IFX_VADC_G_QMR3_RPTDIS_OFF (16u)

/** \brief  Length for Ifx_VADC_G_QMR3_Bits.TREV */
#define IFX_VADC_G_QMR3_TREV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QMR3_Bits.TREV */
#define IFX_VADC_G_QMR3_TREV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QMR3_Bits.TREV */
#define IFX_VADC_G_QMR3_TREV_OFF (9u)

/** \brief  Length for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_OFF (5u)

/** \brief  Length for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_OFF (7u)

/** \brief  Length for Ifx_VADC_G_QSR3_Bits.EMPTY */
#define IFX_VADC_G_QSR3_EMPTY_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QSR3_Bits.EMPTY */
#define IFX_VADC_G_QSR3_EMPTY_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QSR3_Bits.EMPTY */
#define IFX_VADC_G_QSR3_EMPTY_OFF (5u)

