leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_G_QSR3_Bits.EV */
#define IFX_VADC_G_QSR3_EV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QSR3_Bits.EV */
#define IFX_VADC_G_QSR3_EV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QSR3_Bits.EV */
#define IFX_VADC_G_QSR3_EV_OFF (8u)

/** \brief  Length for Ifx_VADC_G_QSR3_Bits.FILL */
#define IFX_VADC_G_QSR3_FILL_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_QSR3_Bits.FILL */
#define IFX_VADC_G_QSR3_FILL_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_QSR3_Bits.FILL */
#define IFX_VADC_G_QSR3_FILL_OFF (0u)

/** \brief  Length for Ifx_VADC_G_QSR3_Bits.REQGT */
#define IFX_VADC_G_QSR3_REQGT_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_QSR3_Bits.REQGT */
#define IFX_VADC_G_QSR3_REQGT_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_QSR3_Bits.REQGT */
#define IFX_VADC_G_QSR3_REQGT_OFF (7u)

/** \brief  Length for Ifx_VADC_G_RCR_Bits.DMM */
#define IFX_VADC_G_RCR_DMM_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_RCR_Bits.DMM */
#define IFX_VADC_G_RCR_DMM_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_RCR_Bits.DMM */
#define IFX_VADC_G_RCR_DMM_OFF (20u)

/** \brief  Length for Ifx_VADC_G_RCR_Bits.DRCTR */
#define IFX_VADC_G_RCR_DRCTR_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_RCR_Bits.DRCTR */
#define IFX_VADC_G_RCR_DRCTR_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_RCR_Bits.DRCTR */
#define IFX_VADC_G_RCR_DRCTR_OFF (16u)

/** \brief  Length for Ifx_VADC_G_RCR_Bits.FEN */
#define IFX_VADC_G_RCR_FEN_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_RCR_Bits.FEN */
#define IFX_VADC_G_RCR_FEN_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_RCR_Bits.FEN */
#define IFX_VADC_G_RCR_FEN_OFF (25u)

/** \brief  Length for Ifx_VADC_G_RCR_Bits.SRGEN */
#define IFX_VADC_G_RCR_SRGEN_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RCR_Bits.SRGEN */
#define IFX_VADC_G_RCR_SRGEN_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RCR_Bits.SRGEN */
#define IFX_VADC_G_RCR_SRGEN_OFF (31u)

/** \brief  Length for Ifx_VADC_G_RCR_Bits.WFR */
#define IFX_VADC_G_RCR_WFR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RCR_Bits.WFR */
#define IFX_VADC_G_RCR_WFR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RCR_Bits.WFR */
#define IFX_VADC_G_RCR_WFR_OFF (24u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV0 */
#define IFX_VADC_G_REFCLR_REV0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV0 */
#define IFX_VADC_G_REFCLR_REV0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV0 */
#define IFX_VADC_G_REFCLR_REV0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV10 */
#define IFX_VADC_G_REFCLR_REV10_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV10 */
#define IFX_VADC_G_REFCLR_REV10_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV10 */
#define IFX_VADC_G_REFCLR_REV10_OFF (10u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV11 */
#define IFX_VADC_G_REFCLR_REV11_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV11 */
#define IFX_VADC_G_REFCLR_REV11_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV11 */
#define IFX_VADC_G_REFCLR_REV11_OFF (11u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV12 */
#define IFX_VADC_G_REFCLR_REV12_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV12 */
#define IFX_VADC_G_REFCLR_REV12_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV12 */
#define IFX_VADC_G_REFCLR_REV12_OFF (12u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV13 */
#define IFX_VADC_G_REFCLR_REV13_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV13 */
#define IFX_VADC_G_REFCLR_REV13_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV13 */
#define IFX_VADC_G_REFCLR_REV13_OFF (13u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV14 */
#define IFX_VADC_G_REFCLR_REV14_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV14 */
#define IFX_VADC_G_REFCLR_REV14_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV14 */
#define IFX_VADC_G_REFCLR_REV14_OFF (14u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV15 */
#define IFX_VADC_G_REFCLR_REV15_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV15 */
#define IFX_VADC_G_REFCLR_REV15_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV15 */
#define IFX_VADC_G_REFCLR_REV15_OFF (15u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV1 */
#define IFX_VADC_G_REFCLR_REV1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV1 */
#define IFX_VADC_G_REFCLR_REV1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV1 */
#define IFX_VADC_G_REFCLR_REV1_OFF (1u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV2 */
#define IFX_VADC_G_REFCLR_REV2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV2 */
#define IFX_VADC_G_REFCLR_REV2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV2 */
#define IFX_VADC_G_REFCLR_REV2_OFF (2u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV3 */
#define IFX_VADC_G_REFCLR_REV3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV3 */
#define IFX_VADC_G_REFCLR_REV3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV3 */
#define IFX_VADC_G_REFCLR_REV3_OFF (3u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV4 */
#define IFX_VADC_G_REFCLR_REV4_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV4 */
#define IFX_VADC_G_REFCLR_REV4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV4 */
#define IFX_VADC_G_REFCLR_REV4_OFF (4u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV5 */
#define IFX_VADC_G_REFCLR_REV5_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV5 */
#define IFX_VADC_G_REFCLR_REV5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV5 */
#define IFX_VADC_G_REFCLR_REV5_OFF (5u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV6 */
#define IFX_VADC_G_REFCLR_REV6_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV6 */
#define IFX_VADC_G_REFCLR_REV6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV6 */
#define IFX_VADC_G_REFCLR_REV6_OFF (6u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV7 */
#define IFX_VADC_G_REFCLR_REV7_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV7 */
#define IFX_VADC_G_REFCLR_REV7_MSK (0x1u)

