leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_bf.h
/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV7 */
#define IFX_VADC_G_REFCLR_REV7_OFF (7u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV8 */
#define IFX_VADC_G_REFCLR_REV8_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV8 */
#define IFX_VADC_G_REFCLR_REV8_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV8 */
#define IFX_VADC_G_REFCLR_REV8_OFF (8u)

/** \brief  Length for Ifx_VADC_G_REFCLR_Bits.REV9 */
#define IFX_VADC_G_REFCLR_REV9_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFCLR_Bits.REV9 */
#define IFX_VADC_G_REFCLR_REV9_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFCLR_Bits.REV9 */
#define IFX_VADC_G_REFCLR_REV9_OFF (9u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV0 */
#define IFX_VADC_G_REFLAG_REV0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV0 */
#define IFX_VADC_G_REFLAG_REV0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV0 */
#define IFX_VADC_G_REFLAG_REV0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV10 */
#define IFX_VADC_G_REFLAG_REV10_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV10 */
#define IFX_VADC_G_REFLAG_REV10_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV10 */
#define IFX_VADC_G_REFLAG_REV10_OFF (10u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV11 */
#define IFX_VADC_G_REFLAG_REV11_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV11 */
#define IFX_VADC_G_REFLAG_REV11_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV11 */
#define IFX_VADC_G_REFLAG_REV11_OFF (11u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV12 */
#define IFX_VADC_G_REFLAG_REV12_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV12 */
#define IFX_VADC_G_REFLAG_REV12_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV12 */
#define IFX_VADC_G_REFLAG_REV12_OFF (12u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV13 */
#define IFX_VADC_G_REFLAG_REV13_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV13 */
#define IFX_VADC_G_REFLAG_REV13_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV13 */
#define IFX_VADC_G_REFLAG_REV13_OFF (13u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV14 */
#define IFX_VADC_G_REFLAG_REV14_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV14 */
#define IFX_VADC_G_REFLAG_REV14_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV14 */
#define IFX_VADC_G_REFLAG_REV14_OFF (14u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV15 */
#define IFX_VADC_G_REFLAG_REV15_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV15 */
#define IFX_VADC_G_REFLAG_REV15_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV15 */
#define IFX_VADC_G_REFLAG_REV15_OFF (15u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV1 */
#define IFX_VADC_G_REFLAG_REV1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV1 */
#define IFX_VADC_G_REFLAG_REV1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV1 */
#define IFX_VADC_G_REFLAG_REV1_OFF (1u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV2 */
#define IFX_VADC_G_REFLAG_REV2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV2 */
#define IFX_VADC_G_REFLAG_REV2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV2 */
#define IFX_VADC_G_REFLAG_REV2_OFF (2u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV3 */
#define IFX_VADC_G_REFLAG_REV3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV3 */
#define IFX_VADC_G_REFLAG_REV3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV3 */
#define IFX_VADC_G_REFLAG_REV3_OFF (3u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV4 */
#define IFX_VADC_G_REFLAG_REV4_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV4 */
#define IFX_VADC_G_REFLAG_REV4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV4 */
#define IFX_VADC_G_REFLAG_REV4_OFF (4u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV5 */
#define IFX_VADC_G_REFLAG_REV5_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV5 */
#define IFX_VADC_G_REFLAG_REV5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV5 */
#define IFX_VADC_G_REFLAG_REV5_OFF (5u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV6 */
#define IFX_VADC_G_REFLAG_REV6_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV6 */
#define IFX_VADC_G_REFLAG_REV6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV6 */
#define IFX_VADC_G_REFLAG_REV6_OFF (6u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV7 */
#define IFX_VADC_G_REFLAG_REV7_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV7 */
#define IFX_VADC_G_REFLAG_REV7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV7 */
#define IFX_VADC_G_REFLAG_REV7_OFF (7u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_OFF (8u)

/** \brief  Length for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_OFF (9u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.CHNR */
#define IFX_VADC_G_RES_CHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.CHNR */
#define IFX_VADC_G_RES_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.CHNR */
#define IFX_VADC_G_RES_CHNR_OFF (20u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.CRS */
#define IFX_VADC_G_RES_CRS_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.CRS */
#define IFX_VADC_G_RES_CRS_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.CRS */
#define IFX_VADC_G_RES_CRS_OFF (28u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.DRC */
#define IFX_VADC_G_RES_DRC_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.DRC */
#define IFX_VADC_G_RES_DRC_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.DRC */
#define IFX_VADC_G_RES_DRC_OFF (16u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.EMUX */
#define IFX_VADC_G_RES_EMUX_LEN (3u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.EMUX */
#define IFX_VADC_G_RES_EMUX_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.EMUX */
#define IFX_VADC_G_RES_EMUX_OFF (25u)

