leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_bf.h
/** \brief  Length for Ifx_VADC_G_RES_Bits.FCR */
#define IFX_VADC_G_RES_FCR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.FCR */
#define IFX_VADC_G_RES_FCR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.FCR */
#define IFX_VADC_G_RES_FCR_OFF (30u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.RESULT */
#define IFX_VADC_G_RES_RESULT_LEN (16u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.RESULT */
#define IFX_VADC_G_RES_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.RESULT */
#define IFX_VADC_G_RES_RESULT_OFF (0u)

/** \brief  Length for Ifx_VADC_G_RES_Bits.VF */
#define IFX_VADC_G_RES_VF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RES_Bits.VF */
#define IFX_VADC_G_RES_VF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RES_Bits.VF */
#define IFX_VADC_G_RES_VF_OFF (31u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.CHNR */
#define IFX_VADC_G_RESD_CHNR_LEN (5u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.CHNR */
#define IFX_VADC_G_RESD_CHNR_MSK (0x1fu)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.CHNR */
#define IFX_VADC_G_RESD_CHNR_OFF (20u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.CRS */
#define IFX_VADC_G_RESD_CRS_LEN (2u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.CRS */
#define IFX_VADC_G_RESD_CRS_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.CRS */
#define IFX_VADC_G_RESD_CRS_OFF (28u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.DRC */
#define IFX_VADC_G_RESD_DRC_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.DRC */
#define IFX_VADC_G_RESD_DRC_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.DRC */
#define IFX_VADC_G_RESD_DRC_OFF (16u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.EMUX */
#define IFX_VADC_G_RESD_EMUX_LEN (3u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.EMUX */
#define IFX_VADC_G_RESD_EMUX_MSK (0x7u)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.EMUX */
#define IFX_VADC_G_RESD_EMUX_OFF (25u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.FCR */
#define IFX_VADC_G_RESD_FCR_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.FCR */
#define IFX_VADC_G_RESD_FCR_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.FCR */
#define IFX_VADC_G_RESD_FCR_OFF (30u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.RESULT */
#define IFX_VADC_G_RESD_RESULT_LEN (16u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.RESULT */
#define IFX_VADC_G_RESD_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.RESULT */
#define IFX_VADC_G_RESD_RESULT_OFF (0u)

/** \brief  Length for Ifx_VADC_G_RESD_Bits.VF */
#define IFX_VADC_G_RESD_VF_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_RESD_Bits.VF */
#define IFX_VADC_G_RESD_VF_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_RESD_Bits.VF */
#define IFX_VADC_G_RESD_VF_OFF (31u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_OFF (0u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_OFF (4u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_OFF (8u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_OFF (12u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_OFF (16u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_OFF (20u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_OFF (24u)

/** \brief  Length for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_OFF (28u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_OFF (8u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_OFF (12u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_LEN (4u)

/** \brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_MSK (0xfu)

/** \brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_OFF (16u)

/** \brief  Length for Ifx_VADC_G_REVNP1_Bits.REV13NP */
#define IFX_VADC_G_REVNP1_REV13NP_LEN (4u)

