leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_bf.h
/** \brief  Mask for Ifx_VADC_G_TRCTR_Bits.ITSEL */
#define IFX_VADC_G_TRCTR_ITSEL_MSK (0x3u)

/** \brief  Offset for Ifx_VADC_G_TRCTR_Bits.ITSEL */
#define IFX_VADC_G_TRCTR_ITSEL_OFF (24u)

/** \brief  Length for Ifx_VADC_G_TRCTR_Bits.OV */
#define IFX_VADC_G_TRCTR_OV_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_TRCTR_Bits.OV */
#define IFX_VADC_G_TRCTR_OV_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_TRCTR_Bits.OV */
#define IFX_VADC_G_TRCTR_OV_OFF (15u)

/** \brief  Length for Ifx_VADC_G_TRCTR_Bits.Q3ACT */
#define IFX_VADC_G_TRCTR_Q3ACT_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_TRCTR_Bits.Q3ACT */
#define IFX_VADC_G_TRCTR_Q3ACT_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_TRCTR_Bits.Q3ACT */
#define IFX_VADC_G_TRCTR_Q3ACT_OFF (14u)

/** \brief  Length for Ifx_VADC_G_TRCTR_Bits.SRDIS */
#define IFX_VADC_G_TRCTR_SRDIS_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_TRCTR_Bits.SRDIS */
#define IFX_VADC_G_TRCTR_SRDIS_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_TRCTR_Bits.SRDIS */
#define IFX_VADC_G_TRCTR_SRDIS_OFF (28u)

/** \brief  Length for Ifx_VADC_G_TRCTR_Bits.TSC */
#define IFX_VADC_G_TRCTR_TSC_LEN (6u)

/** \brief  Mask for Ifx_VADC_G_TRCTR_Bits.TSC */
#define IFX_VADC_G_TRCTR_TSC_MSK (0x3fu)

/** \brief  Offset for Ifx_VADC_G_TRCTR_Bits.TSC */
#define IFX_VADC_G_TRCTR_TSC_OFF (0u)

/** \brief  Length for Ifx_VADC_G_TRCTR_Bits.TSCSET */
#define IFX_VADC_G_TRCTR_TSCSET_LEN (6u)

/** \brief  Mask for Ifx_VADC_G_TRCTR_Bits.TSCSET */
#define IFX_VADC_G_TRCTR_TSCSET_MSK (0x3fu)

/** \brief  Offset for Ifx_VADC_G_TRCTR_Bits.TSCSET */
#define IFX_VADC_G_TRCTR_TSCSET_OFF (16u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF0 */
#define IFX_VADC_G_VFR_VF0_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF0 */
#define IFX_VADC_G_VFR_VF0_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF0 */
#define IFX_VADC_G_VFR_VF0_OFF (0u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF10 */
#define IFX_VADC_G_VFR_VF10_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF10 */
#define IFX_VADC_G_VFR_VF10_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF10 */
#define IFX_VADC_G_VFR_VF10_OFF (10u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF11 */
#define IFX_VADC_G_VFR_VF11_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF11 */
#define IFX_VADC_G_VFR_VF11_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF11 */
#define IFX_VADC_G_VFR_VF11_OFF (11u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF12 */
#define IFX_VADC_G_VFR_VF12_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF12 */
#define IFX_VADC_G_VFR_VF12_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF12 */
#define IFX_VADC_G_VFR_VF12_OFF (12u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF13 */
#define IFX_VADC_G_VFR_VF13_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF13 */
#define IFX_VADC_G_VFR_VF13_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF13 */
#define IFX_VADC_G_VFR_VF13_OFF (13u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF14 */
#define IFX_VADC_G_VFR_VF14_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF14 */
#define IFX_VADC_G_VFR_VF14_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF14 */
#define IFX_VADC_G_VFR_VF14_OFF (14u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF15 */
#define IFX_VADC_G_VFR_VF15_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF15 */
#define IFX_VADC_G_VFR_VF15_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF15 */
#define IFX_VADC_G_VFR_VF15_OFF (15u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF1 */
#define IFX_VADC_G_VFR_VF1_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF1 */
#define IFX_VADC_G_VFR_VF1_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF1 */
#define IFX_VADC_G_VFR_VF1_OFF (1u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF2 */
#define IFX_VADC_G_VFR_VF2_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF2 */
#define IFX_VADC_G_VFR_VF2_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF2 */
#define IFX_VADC_G_VFR_VF2_OFF (2u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF3 */
#define IFX_VADC_G_VFR_VF3_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF3 */
#define IFX_VADC_G_VFR_VF3_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF3 */
#define IFX_VADC_G_VFR_VF3_OFF (3u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF4 */
#define IFX_VADC_G_VFR_VF4_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF4 */
#define IFX_VADC_G_VFR_VF4_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF4 */
#define IFX_VADC_G_VFR_VF4_OFF (4u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF5 */
#define IFX_VADC_G_VFR_VF5_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF5 */
#define IFX_VADC_G_VFR_VF5_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF5 */
#define IFX_VADC_G_VFR_VF5_OFF (5u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF6 */
#define IFX_VADC_G_VFR_VF6_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF6 */
#define IFX_VADC_G_VFR_VF6_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF6 */
#define IFX_VADC_G_VFR_VF6_OFF (6u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF7 */
#define IFX_VADC_G_VFR_VF7_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF7 */
#define IFX_VADC_G_VFR_VF7_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF7 */
#define IFX_VADC_G_VFR_VF7_OFF (7u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF8 */
#define IFX_VADC_G_VFR_VF8_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF8 */
#define IFX_VADC_G_VFR_VF8_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF8 */
#define IFX_VADC_G_VFR_VF8_OFF (8u)

/** \brief  Length for Ifx_VADC_G_VFR_Bits.VF9 */
#define IFX_VADC_G_VFR_VF9_LEN (1u)

/** \brief  Mask for Ifx_VADC_G_VFR_Bits.VF9 */
#define IFX_VADC_G_VFR_VF9_MSK (0x1u)

/** \brief  Offset for Ifx_VADC_G_VFR_Bits.VF9 */
#define IFX_VADC_G_VFR_VF9_OFF (9u)

/** \brief  Length for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY0 */
#define IFX_VADC_GLOBBOUND_BOUNDARY0_LEN (12u)

/** \brief  Mask for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY0 */
#define IFX_VADC_GLOBBOUND_BOUNDARY0_MSK (0xfffu)

/** \brief  Offset for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY0 */
#define IFX_VADC_GLOBBOUND_BOUNDARY0_OFF (0u)

/** \brief  Length for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY1 */
#define IFX_VADC_GLOBBOUND_BOUNDARY1_LEN (12u)

